{
    "modelTopology": {
        "backend": "tensorflow",
        "keras_version": "2.2.4",
        "model_config": {
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_19",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                null,
                                40
                            ],
                            "dtype": "float32",
                            "name": "input_19",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_19"
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "activation": "tanh",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "dropout": 0.0,
                            "go_backwards": false,
                            "implementation": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "lstm_7",
                            "recurrent_activation": "hard_sigmoid",
                            "recurrent_constraint": null,
                            "recurrent_dropout": 0.0,
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "recurrent_regularizer": null,
                            "return_sequences": true,
                            "return_state": true,
                            "stateful": false,
                            "trainable": true,
                            "unit_forget_bias": true,
                            "units": 10,
                            "unroll": false,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_19",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "lstm_7"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "dense_7",
                            "trainable": true,
                            "units": 40,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "lstm_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "dense_7"
                    }
                ],
                "name": "model_13",
                "output_layers": [
                    [
                        "dense_7",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "loss_weights": null,
            "metrics": [],
            "optimizer_config": {
                "class_name": "SGD",
                "config": {
                    "decay": 9.999999974752427e-07,
                    "lr": 0.10000000149011612,
                    "momentum": 0.8999999761581421,
                    "nesterov": false
                }
            },
            "sample_weight_mode": null
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1"
            ],
            "weights": [
                {
                    "dtype": "float32",
                    "name": "dense_7/kernel",
                    "shape": [
                        10,
                        40
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "dense_7/bias",
                    "shape": [
                        40
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "lstm_7/kernel",
                    "shape": [
                        40,
                        40
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "lstm_7/recurrent_kernel",
                    "shape": [
                        10,
                        40
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "lstm_7/bias",
                    "shape": [
                        40
                    ]
                }
            ]
        }
    ]
}
