{"modelTopology": {"keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, 38], "name": "input_5", "sparse": false}, "name": "input_5"}, {"class_name": "LSTM", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "name": "lstm_2"}, {"class_name": "Dense", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 38, "use_bias": true, "activity_regularizer": null}, "name": "dense_3"}], "output_layers": [["dense_3", 0, 0]], "name": "model_4", "input_layers": [["input_5", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 38], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [38], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [38, 256], "name": "lstm_2/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "lstm_2/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "lstm_2/bias"}]}]}